Revit 2027 API
ZoneEquipmentData Methods
The ZoneEquipmentData type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsDataCompleted |  Is the required data completed for this zone equipment?
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace